Игра три в ряд в консоли, игрок вводом меняет фигуры местами, есть бонусы за комбинации. За комбинации и 3 в ряд игрок получает очки.

Сущности
1)Game - луп игры, следит за текущим состоянием игры, определяет порядок действий,
2)Board - игровое поле, отвечает за перестановку фигур, схлопывание комбинаций, добавление новых фигур на поле
3)Piece - сама фигура на поле, может сравнивать себя с другими фигурами, хранит информацию о том, что конкретно это за фигура
4)MatchResolver - ищет на доске комбинации, схлопывает их
5)GameIO - считывает пользовательский ввод, выводит игру в консоль
6)GameStats - начисляет очки игроку
7)PieceGenerator - создает новые фигуры, которые будут появляться на месте исчезнувших